In [ ]:
# 175 Combine two tables
SELECT Person.FirstName, Person.LastName, Address.City, Address.State
FROM Person LEFT JOIN Address
ON Person.PersonId = Address.PersonID;

In [ ]:
# 176 Second Highest Salary
SELECT MAX(Salary)
FROM Employee
WHERE Salary < (SELECT Max(Salary) FROM Employee);

In [ ]:
# 177 Nth Highest Salary
CREAT FUNCTION getNthHighestSalary(N INT) RETURN INT
BEGIN 
    RETURN (
            # Write your MySQL query statement below.
            SELECT DISTINCT e1.Salary
            FROM Employee e1
            WHERE N - 1 = (
                            SELECT DISTINCT COUNT(e2.Salary) 
                            FROM Employee e2
                            WHERE e1.Salary < e2.Salary) 
    );
END

# Answer 2
CREAT FUNCTION getNthHighestSalary(N INT) RETURN INT
BEGIN 
DECLEAR M INT;
SET M = N - 1;
    RETURN (
            # Write your MySQL query statement below.
            SELECT DISTINCT Salary
            FROM Employee
            ORDER BY Salary LIMIT M, 1
    );
END

In [ ]:
# 603 Consecutive Available Seats
SELECT DISTINCT c1.seat_id 
FROM cinema c1 left join cinema c2
ON abs(c1.seat_id - c2.seat_id) = 1
AND c1.free = TRUE AND c2.free = TRUE
ORDER BY c1.seat_id;

# Answer 2
SELECT c1.seat_id FROM cinema c1
WHERE c1.free = 1
AND
(
c1.seat_id + 1 IN (SELECT seat_id FROM cinema WHERE free = 1)
OR
c1.seat_id - 1 IN (SELECT seat_id FROM cinema WHERE free = 1)
)
ORDER BY c1.seat_id;

In [ ]:
# 178 Rank Scores

SELECT 
    Score,
    (SELECT count(distinct Score) FROM Scores WHERE Score >= s.Score) Rank
FROM Score s
ORDER BY Score DESC;

In [ ]:
# 579 Find Cumulative Salary of an Employee

SELECT A.Id, MAX(B.Month) as Month, SUM(B.Salary) as Salary
FROM Employee A, Employee B
WHERE A.Id = B.Id AND B.Month BETWEEN (A.Month - 3) AND (A.Month - 1)
GROUP BY A.Id, A.Month
ORDER BY Id, Month DESC;

In [ ]:
# 608 Tree Node
SELECT T.id,
IF (isnall(T.p_id),'Root', IF(T.id in (SELECT p_id FROM tree), 'Inner', 'Leaf')) Type
FROM tree T;

In [ ]:
# 610 Triangle Judgement
SELECT x,y,z,
CASE WHEN x+y<z OR
          x+z<y OR
          Y+Z<x
     Then 'No'
     ELSE 'Yes'
END AS 'triangle'
FROM triangle;

In [ ]:
# 180 Consecutive Numbers
SELECT DISTINCT l1.Num AS ConsecutiveNums FROM Logs l1, Logs l2, Logs l3
WHERE l1.Id = l2.Id-1 AND l2.Id = l3.Id-1
AND l1.Num = l2.Num AND l2.Num = l3.Num;

# 2nd Solution 
SELECT T.Num AS ConsecutiveNums
FROM 
(SELECT DISTINCT A.Num FROM Logs A
LEFT JOIN Logs B on A.Id = B.Id-1
LEFT JOIN Logs C on A.Id = C.Id-2
WHERE A.Num = B.Num AND A.Num = C.Num) T;

# 3rd Solution
SELECT DISTINCT l1.Num 
FROM Logs l1 left join Logs l2
ON abs(l1.Id - l2.Id) = 1
AND l1.Num = l2.Num
ORDER BY c1.seat_id;

In [ ]:
# 181 Employees Earning more than Their Managers
SELECT e.Name AS Employee
FROM Employee e, Employee m
WHERE e.ManagerId is not NULL AND 
e.ManagerId = m.Id AND e.Salary > m.Salary;

In [ ]:
# 182 Duplicate Emails
SELECT Email
FROM Person
GROUP BY Email 
HAVING COUNT(*)>1;

In [ ]:
# 183 Customers Who Never Order
SELECT A.Name FROM Customers A
Where NOT EXISTS (SELECT 1 FROM Orders B WHERE A.Id = B.CustomerId);

# 
SELECT A.Name FROM Customers A
LEFT JOIN Orders B on A.Id = B.CustomerId
WHERE B.CustomerId is NULL;

#
SELECT A.Name FROM Customers A
WHERE A.Id NOT IN (SELECT B.CustomerId FROM Orders B);

In [ ]:
# 184 Department Highest Salary 
SELECT dep.Name AS Department, emp.Name AS Employee, emp.Salary
FROM Employee emp, Department dep
WHERE emp.DepartmentId = dep.Id
AND 
(
emp.Salary = 
(SELECT MAX(e2.Salary) FROM Employee e2 WHERE e2.DepartmentId = dep.Id)
);

# Answer 2
SELECT D.Name AS Department, E.Name AS Employee, E.Salary 
FROM 
    Employee E,
    (SELECT DepartmentId, Max(Salary) AS max FROM Employee GROUP BY DepartmentId) T,
    Deparment D
WHERE E.DepartmentId = T.DepartmentId
AND E.Salary = T.max
AND D.Id = T.Department;

In [ ]:
# 185 Department Top Three Salaries 
SELECT D.Name AS Department, E.Name AS Employee, E.Salary
FROM Department D, Employee E, Employee E2
WHERE D.Id = E.DepartmentId AND E.DepartmentId = E2.DepartmentId
AND E.Salary <= E2.Salary
GROUP BY D.Id, E.Name HAVING COUNT(DISTINCT E2.Salary) <=3
ORDER BY D.Name, E.Salary DESC;

# Answer 2
SELECT tb2.Name AS Department, tb1.Name AS Employee, tb1.Salary
FROM Employee AS tb1
INNER JOIN Department AS tb2
ON tb1.DepartmentId = tb2.Id
WHERE (SELECT COUNT(DISTINCT Salary) 
       FROM Employee AS tb3 
       WHERE tb1.DepartmentId = tb3.DepartmentId AND tb1.Salary < tb3.Salary) < 3;

In [ ]:
# 595 Big Countries 
SELECT name, population, area
FROM world
WHERE area > 3000000 OR population > 25000000;

In [ ]:
# 196 Delete Duplicate Emails 
DELECT p1
FROM Person p1, Person p2
WHERE p1.Email = p2.Email AND 
p1.Id > p2.Id;

In [ ]:
# 626 Exchange Seats 
SELECT
    CASE 
        WHEN seat.id % 2 <> 0 AND seat.id = (SELECT COUNT(*) FROM seat) THEN seat.id
        WHEN seat.id % 2 = 0 THEN seat.id - 1
        ELSE seat.id + 1
    END AS id, student 
FROM seat
ORDER BY id;

In [ ]:
# 569 Median Employee Salary
SELECT e1.Id, e1.Company, e1.Salary
FROM Employee e1
GROUP BY Company
HAVING abs(SELECT COUNT(*) FROM Employee WHERE Salary > e1.Salary - SELECT COUNT(*) FROM Employee WHERE Salary < e1.Salary) < 1 # this is a wrong anwer 

# right answer below
SELECT Id, Company, Salary
FROM Employee e1
WHERE abs((SELECT COUNT(*) FROM Employee e2 WHERE e1.Company = e2.Company AND e2.Salary >= e1.Salary) - 
          (SELECT COUNT(*) FROM Employee e3 WHERE e3.Company = e1. Company AND e3.Salary <= e1.Salary)) <= 1;

In [ ]:
# 615 Average Salary: Departments vs Company 
SELECT d1.pay_month, d1.department_id, 
CASE WHEN d1.department_avg > c1.company_avg THEN 'higher'
     WHEN d1.department_avg = c1.company_avg THEN 'same'
     ELSE 'same'
END AS 'comparison'
FROM 
((SELECT LEFT(s1.pay_date, 7) pay_month, e1.department_id, AVG(s1.amount) FROM salary s1 JOIN employee e1 ON s1.employee_id = e1.employee_id GROUP BY pay_month, e1.department_id) d1
 LEFT JOIN (SELECT LEFT(pay_date, 7) pay_month, AVG(amount) company_avg FROM salary GROUP BY pay_month) c1 ON d1.pay_month = c1.pay_month)
GROUP BY pay_month DESC, department_id;

In [ ]:
# 570 Managers with at least 5 direct reports 
SELECT e1.Name 
FROM Employee e1 
LEFT JOIN Employee e2
ON e1.Id = e2.ManagerId
GROUP BY e1.ManagerId
Having COUNT(e1.Id) >= 5; # this is my answer, might be wrong 

# this is the more clear answer
SELECT Name 
FROM Employee e1 JOIN
(SELECT ManagerId FROM Employee e2 GROUP BY ManagerId Having COUNT(ManagerId) >= 5) m1
ON e1.Id = m1.ManagerId;

In [ ]:
# 597 Friend requests 1: overall acceptance rate
SELECT (SELECT COUNT(DISTINCT *) 
FROM request_accetpted r1, friend_request f1
WHERE r1.requester_id = f1.sender_id AND r1.accepter_id = f1.send_to_id)/COUNT(*) accept_rate
FROM friend_request; # this is my answer, might be wrong

# here is a more clear solution
SELECT IFNULL(ROUND(COUNT(DISTINCT requester_id, accepter_id) / COUNT(DISTINCT sender_id, send_to_id), 2), 0) AS accept_rate
FROM request_accepted, friend_request

In [ ]:
# 574 Winning Candidate
SELECT Name 
FROM Candidate c
JOIN 
(SELECT DISTINCT CandidatedId 
FROM Vote 
GROUP BY CandidateId
ORDER BY COUNT(CandidateId) DESC LIMIT 1) AS c1
ON c.id = c1.CandidateId

# this is the answer, i am not sure if it's right 
SELECT Name AS 'Name'
FROM Candidate c
JOIN 
(SELECT CandidateId
FROM Vote
GROUP BY CandidatedId
ORDER BY COUNT(*) DESC 
LIMIT 1) c1
WHERE c.id = c1.CandidateId

In [ ]:
# 579 Find Cumulative Salary of an Employee
SELECT 
    a.id,
    a.month,
    SUM(b.salary) Salary
FROM 
    Employee a JOIN Employee b ON
    a.id = b.id AND 
    a.month - b.month >= 0 AND
    a.month - b.month < 3
GROUP BY 
    a.id, a.month
HAVING (a.id, a.month) NOT IN (SELECT id, MAX(month) FROM Employee GROUP BY id)
ORDER BY 
    a.id, a.month DESC

In [ ]:
# 197 Rising Temperature
SELECT wt1.Id
FROM Weather wt1, Weather wt2
WHERE wt1.Temperature > wt2.Temperature AND TO_DAYS(wt1.RecordDate) = TO_DAYS(wt2.RecordDate) + 1;

In [ ]:
# 262 Trips and Users
SELECT Request_at AS Day,
       ROUND(SUM(CASE WHEN States LIKE 'cancelled%' THEN 1 ELSE 0 END)/COUNT(*),2) AS 'Cancellation Rate'
FROM(
    SELECT * FROM Trips t
    WHERE
         t.Client_Id NOT IN (SELECT Users_Id FROM Users WHERE Banned = 'Yes') AND
         t.Driver_Id NOT IN (SELECT Users_Id FROM Users WHERE Banned = 'Yes') AND
         t.Request_at BETWEEN '2013-10-01' AND '2013-10-03'
    ) AS newT
GROUP BY Request_at;

In [7]:
chars = ['a','a','b','b','b']
unique = set(chars)
unique
for i in unique:
    print(str(chars.count(i)))

2
3

In [4]:
chars = ['aabbb']
unique = set(chars)
unique
for i in unique:
    print(i)

aabbb

In [10]:
def compress(chars):
    unique = set(chars)
    string = ''
    for i in unique:
        if str(chars.count(i)) == '1':
            string = string + str(i)
        else:
            string = string + str(i) + str(chars.count(i))
    result = list(string)
    print(result)
    return len(result)

In [11]:
compress(['a','a','b','b','b'])

['a', '2', 'b', '3']

4

In [30]:
class Solution:
    def compress(chars) -> int:
        unique = set(chars)
        string = ''
        for i in unique:
            if str(chars.count(i)) == '1':
                string = string + (str(i))
            else:
                string = string + str(i)+ str(chars.count(i))
        
        result = list(string)
        return len(result)

In [32]:
Solution.compress(chars = ['a','a','b','b','b'])

4

In [ ]:
# 571 Find Median Given Frequency of Numbers
SELECT AVG(n.Number) median 
FROM Numbers n
WHERE n.Frequency >= ABS((SELECT SUM(Frequency) FROM Numbers WHERE Number>=n.Number) - (SELECT SUM(Frequency) FROM Numbers WHERE Number <= n.Nnumber));

In [ ]:
# 577 Employee Bonus
SELECT name, bonus 
FROM 
Employee LEFT JOIN Bonus 
ON Employee.empId = Bonus.empId
WHERE Bonus.bonus < 1000 OR bouns IS NULL;

In [ ]:
# 578 Get Highest Answer Rate Question
SELECT question_id AS survey_log
FROM 
(
SELECT question_id, SUM(CASE WHEN action = 'show' THEN 1 ELSE 0 END) AS num_show,
SUM(CASE WHEN action = 'answer' THEN 1 ELSE 0 END) AS num_anwer
FROM survey_log
GROUP BY question_id) AS tbl
ORDER BY (num_answer/num_show) DESC LIMIT 1;

In [ ]:
# 580 Count Student Number in Department
SELECT d.dept_name, COUNT(s.student_id) AS student_number
FROM student s RIGHT JOIN department d ON s.dept_id = d.dept_id
GROUP BY d.dept_name
ORDER BY student_name DESC. d.dept_name;

# The output need Law, so we use RIGHT JOIN here.

In [ ]:
# 584 Find Customer Referee
SELECT name 
FROM customer
WHERE referee_id <> 2 OR referee_id IS NULL;

In [ ]:
# 585 Investments in 2016
SELECT SUM(TIV_2016) TIV_2016 FROM insurance a
WHERE 1 = (SELECT COUNT(*) FROM insurance b WHERE a.LAT = b.LAT AND a.LON = b.LON)
AND (SELECT COUNT(*) FROM insurance c WHERE a.TIV_2015 = c.TIV_2015) > 1 ;

In [ ]:
# 586 Customer Placing the Largest Number of Orders
SELECT customer_number FROM orders
GROUY BY customer_number
ORDER BY count(*) DESC LIMIT 1;

In [ ]:
# 596 Classes More Than 5 Students
SELECT class FROM cousrses
GROUP BY class HAVING COUNT(DISTINCTstudent) >= 5;

In [ ]:
# 601 Human Traffic of Stadium
SELECT s1.* FROM stadium AS s1, stadium AS s2, stadium AS s3
WHERE 
((s1.id+1=s2.id
 AND s1.id +2 = s3.id)
 OR 
 (s1.id-1 = s2.id
 AND s1.id + 1 = s3.id)
 OR 
 (s1.id - 1 = s2.id AND s1.id -2 = s3.id)
)
AND s1.people > 100
AND s2.people > 100
AND s3.people > 100
GROUP BY s1.id;

In [ ]:
# 602 Friend Requests 2: Who Has the Most Friends
SELECT id1 AS id, COUNT(id2) AS num
FROM 
(SELECT requester_id AS id1, accepter_id AS id2 FROM request_accepted
union
SELECT accepter_id AS id1, requester_id AS id2
FROM request_accepted) tmp1
GROUP BY id1
ORDER BY num DESC LIMIT 1;

In [ ]:
# 607 Sales Person
SELECT salesperson.name 
FROM orders o JOIN company c ON (o.com_id = c.com_id AND c.name = 'RED')
RIGHT JOIN salesperson on salesperson.sales_id = o.sales_id
WHERE o.sales_id IS NULL;

In [ ]:
# 612 Shortest Distance in a Plane
SELECT ROUND(SQRT(MIN(POW(a.x-b.x,2)+POW(a.y-b.y,2))),2) shortest
FROM point_2d a, point_ad b
WHERE (a.x, a.y) != (b.x, b.y);

In [ ]:
# 613 Shortest Distance in a Line
SELECT MIN(ABS(a.x - b.x)) shortest 
FROM point a, point b
WHERE a.x <> b.x

#
SELECT MIN(ABS(p1.x - p2.x)) AS shortest
FROM point AS p1
JOIN point AS p2
ON p1.x <> p2.x;

In [ ]:
# 614 Second Degree Follower
SELECT DISTINCT follower, num
FROM follow,
(SELECT followee, COUNT(DISTINCT follower) AS num FROM follow
GROUP BY followee) AS t
WHERE follower = t.followee
ORDER BY follower;

# 
SELECT f1.follower, COUNT(DISTINCT f2.follower)
FROM follow f1
JOIN follow f2
ON f1.follower = f2.followee
GROUP BY f1.follower
ORDER BY f1.follower;

In [ ]:
# 618 Students Report By Geography
SELECT MAX(America) AS America, MAX(Asia) AS Asia, MAX(Europe) AS Europe
FROM (
      SELECT 
            CASE WHEN continent = 'America' THEN @r1 := @r1 + 1
                 WHEN continent = 'Asia' THEN @r2 := @r2 +1
                 WHEN continent = 'Europe' THEN @r3 := @r3 +1 END id,
            CASE WHEN continent = 'America' THEN name ELSE NULL END America,
            CASE WHEN continent = 'Asia' THEN name ELSE NULL END Asia,
            CASE WHEN continent = 'Europe' THEN name ELSE NULL END Europe
      FROM student, (SELECT @r1 :=0, @r2 :=0, @r3 :=0) AS ids
      ORDER BY name
) AS tempTable
GROUP BY id;

In [ ]:
# 619 Biggest Single Number
SELECT num as num
FROM number
GROUP BY num
HAVING COUNT(*) = 1
ORDER BY num DESC LIMIT 1;

In [ ]:
# 620 Not Boring Movies
SELECT *
FROM cinema 
WHERE (id % 2 = 1) AND (description <> 'boring')
ORDER BY rating DESC;

In [ ]:
# 627 Swap Salary
UPDATE salary SET sex = CHAR(ASCII('f')^ASCII('m')^ASCII('sex'));

#
UPDATE salary SET sex = CHAR(ASCI('f') + ASCII('m') - ASCII(sex));

In [1]:
t = 3000000/40
print(t)

75000.0

In [2]:
y = 75000/365
print(y)

205.4794520547945

In [4]:
t = 3000000/300/365
print(t)

27.397260273972602

In [5]:
t = 3000000/365/5
print(t)

1643.835616438356

In [ ]:
Tables
1: Users   
user_id | install_date | channel (paid/organic)
2: Revenue --- records each subscription
         user_id | calender_date | revenue
3: Events --- records each instance of user actions (each time user sings, each time user is active)
         user_id | calender_date | event_name(singing,active_user) | timestamp

In [ ]:
Q1: how many users  installed?

SELECT
COUNT(DISTINCT user_id) AS total_users
FROM
Users
WHERE
install_date IS NOT NULL

In [ ]:
Q2: what proportion came through paid channels?
SELECT 
SUM(CASE WHEN channel = 'paid' THEN 1 ELSE 0 END)/COUNT(*) AS paid_ratio
FROM 
Users
WHERE 
install_date is NOT NULL

OR

Select Round(count(distinct user_id) *100 /(select count(distinct user_id) from users),2)
From users
Where channel=’Paid’

In [ ]:
Q3: What was the average revenue per user generated between the day a user installed and seven days later (Day 8 Revenue per User)?  e.g. 1000 installs, $500 revenue, $0.50 RPU
WITH New_t AS (
SELECT
User_id, install_date, calender_date, revenue
FROM
Users U
JOIN        Revenue R ON U.user_id = R.user_id
WHERE
Calender_date < = date_add(install_date, INTERVAL 7 DAY) )

SELECT User_id, AVG(revenue) AS avg_rvnue
FROM 
New_t
GROUP BY
User_id

In [ ]:
Q4: Calculate Day 2 retention based on the number of times a user sang on Day 1?

WITH new_t AS (
SELECT
User_id
, MIN(Calender_date) AS first_day
FROM
Events
WHERE
Event_name = ‘singing’
GROUP BY
user_id)
,
Return_user AS
(SELECT
user_id
FROM
Events E1
JOIN
new_t  ON (E1.user_id = new_t.user_id AND new_t.first_day + 1 = E1.canlender_date))

SELECT
ROUND(COUNT(return_user.user_id)/COUNT(new_t.user_id),2) AS retention_rate
FROM
New_t
LEFT JOIN
Return_user ON return_user.user_id = new_t.user_id

In [ ]:
FB 经典题目！
有个table,有content_id, content_type,target_id  其中content_type有post,comment,like,photo等, target_id 是comment 对应的post_id(for example comment 对应的post_id)   
Q1: 求最多comment的post 的id

SELECT Target_id
FROM
(
SELET Target_id, RANK()
OVER 
(ORDER BY COUNT(content_id) DESC) 
AS rank_list
FROM 
Table 
WHERE 
Content_type = 'comment'
) AS rank_table
WHERE 
Rank_list = 1

Q2:求comment数目的分布

WITH comment_table AS (
SELECT 
Content_id, COUNT(Content_type) AS comment
FROM 
Table 
WHERE
Content_type = 'comment'
GROUP BY Content_id)

SELECT 
Comment, COUNT(content_id) AS cnt
FROM 
Comment_table
GROUP BY 
Commment
COUNT(content_id);

Q3: What is the total number of comments and total number of posts
SELECT 
SUM(IF(content_type = 'comment',1,0)) AS total_comment, SUM(IF(content_type='post', 1, 0)AS total_post)
FROM Table;

In [ ]:
FB 经典题目！
Table Friend:   Date | Action (‘sent’, ‘accept’, ‘unfriend’) | User_id   | Target_id
如何判断两个人是不是好朋友. (Target user’s action is accepted)

SELECT F1.User_id, F1.Target.id,
CASE WHEN accepter_table.action = 'accept' AND sender_table.action = 'sent' THEN 'yes'
ELSE 'no' END AS friends
FROM 
Friend AS sender_table
LEFT JOIN Friend AS accept_table ON accept_table.User_id = sender_table.Target_id;

generate friend request acceptance rate (a: Create the table for calculation, b: calculate acceptance rate)
SELECT ROUND(COUNT(accepter_table.User_id)/COUNT(sender_table.User_id),2) AS acceptance_rate
FROM 
Friend AS sender_table
LEFT JOIN 
Friends AS accepter_table ON sender_table.Target_id = accepter_table.User_id;

Generate the friend request acceptance rate for people who accept within 24 hours
SELECT
  ROUND( COUNT(accepter_table.User_id)/COUNT(sender_table.User_id),2) AS acceptence_rate
FROM
Friend AS sender_table
LEFT JOIN
           Friend AS accepter_table
ON (accepter_table.User_id = sender_table.Target_id AND DATE_ADD('hour', 24, sender_table.date) <= accepter_table.date AND accept_table.date > sender_table.date

In [ ]:
Instagram NBA Follower
Table 1 (stars_category) [name,sports category] t1中只有celebrity运动员。pk=user_name
Table 2 (instgram_users) [user id, user_name, registration_date] t(2中是所有人的用户信息，包括celebrity和普通人，且不会出现celebrity和普通人重名的情况（重要假设）。pk=user_id
Table 3 (followee_follower) user_id, user_id_following, follow_date] 用户follow信息，注意user_id_following中包括celebrity和普通人
                                                                   
Q1:求每个category的follower/计算每个category有多少人follow

SELECT
Category
          , COUNT(ff.user_id)
FROM
(SELECT
  User_id
           , Category
  FROM
  Instgram_users iu
  LEFT JOIN stars_category sc ON sc.name = iu.user_name) as table_a
JOIN
Followee_follower ON table_a.user_id = ff.user_id_following
GROUP BY
Category

Q2: 求有多少个NBA category follow NFL . check 1point3acres for more.

WITH NFL AS (SELECT
user_id
FROM
Instgram_users iu
JOIN
Starts_category sc ON iu.user_name = sc.name
WHERE
Category = ‘NFL’)

SELECT
          COUNT(iu.user_id) AS total_NBA
FROM
Instgram_users iu
JOIN
stars_category sc ON sc.name = iu.user_name
JOIN
Followee_follower ON iu.user_id = ff.user_id
JOIN. 1point3acres
NFL ON NFL.user_id = ff.user_id_following
WHERE
Category = ‘NBA’
                                                                   
table  member_id|company_name|year_start    note: table is employee info  table
Q1: count members who ever moved from Microsoft to Google?
SELECT
COUNT(Member_id) AS total_count
FROM
Table AS T1
JOIN
Table AS T2
ON        (T1.member_id = T2.member_id
AND   T1. year_start < T2.year_start)
. From 1point 3acres bbs
WHERE-baidu 1point3acres
T1.company_name = ‘Microsoft’
AND   T2.company_name = ‘Google’
;
                                                                   

Q2:  count members who directly moved from Microsoft to Google? (Microsoft -- linkedin -- Google doesn't count)

WITH rnk_table AS (
SELECT
   *. check 1point3acres for more.
, RANK()OVER(PARTITION BY member_id ORDER BY year_start ASC) AS rnk_index
FROM
Table)

SELECT
COUNT(member_id) AS total_count
FROM
rnk_table T1
JOIN
Rnk_table T2 AS T2
ON         (T1.member_id = T2.member_id
AND         T2.rnk_index = T1.rnk_index + 1)-baidu 1point3acres
WHERE
T1.company_name = ‘Microsoft’
AND   T2.company_name = ‘Google’
;